# Traducción: Python to R
A continuación, deberás "traducir" estos ejercicios de programación en Python, al lenguaje R, en R-Studio.

In [27]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [28]:
#Ejercicios de W2-3.1.WarmUp_CombiningDatasets

## Combining datasets
### Example: US States Data
Merge and join operations come up most often when combining data from different sources. Here we will consider an example of some data about US states and their populations. The data files can be found at http://github.com/jakevdp/data-USstates/:

In [29]:
pop = pd.read_csv("C:\\Users\\34609\\Documents\\DataTB\\4.R\\Trans Py2R\\state-population.csv") 
areas = pd.read_csv("C:\\Users\\34609\\Documents\\DataTB\\4.R\\Trans Py2R\\state-areas.csv")
abbrevs = pd.read_csv("C:\\Users\\34609\\Documents\\DataTB\\4.R\\Trans Py2R\\state-abbrevs.csv")

display(pop.head(3), areas.head(3), abbrevs.head(3)) #show the head of the 3 imported .csv files

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0

     state  area (sq. mi)
0  Alabama          52423
1   Alaska         656425
2  Arizona         114006

     state abbreviation
0  Alabama           AL
1   Alaska           AK
2  Arizona           AZ

Junta en un mismo DataFrame la informarción de pop y abbrevs, eliminando la información duplicada.

In [30]:
merged = pd.merge(pop, abbrevs, how ='outer', left_on ='state/region', right_on ='abbreviation') #how indicates that
merged = merged.drop('state/region', 1) # drop duplicate info
merged.head()

#IMPORTANT!! [How] indicates that we want all the information to get in the new DF. [lefy_on] together with [right_on] indicate the columns that the old DF get merged by.

      ages  year  population    state abbreviation
0  under18  2012   1117489.0  Alabama           AL
1    total  2012   4817528.0  Alabama           AL
2  under18  2010   1130966.0  Alabama           AL
3    total  2010   4785570.0  Alabama           AL
4  under18  2011   1125763.0  Alabama           AL

In [31]:
merged.describe() #statistical info of the DF

              year    population
count  2544.000000  2.524000e+03
mean   2001.500000  6.805558e+06
std       6.923547  2.855014e+07
min    1990.000000  1.013090e+05
25%    1995.750000  7.423805e+05
50%    2001.500000  1.597005e+06
75%    2007.250000  4.547104e+06
max    2013.000000  3.161288e+08

In [32]:
merged.isnull().any() #display if in any category has null values

ages            False
year            False
population       True
state            True
abbreviation     True
dtype: bool

Some of the ``population`` info is null; let's figure out which these are!

In [36]:
print(merged["population"].isnull().value_counts())
print(merged.shape)
merged.head(3)

False    2524
True       20
Name: population, dtype: int64
(2544, 5)

      ages  year  population    state abbreviation
0  under18  2012   1117489.0  Alabama           AL
1    total  2012   4817528.0  Alabama           AL
2  under18  2010   1130966.0  Alabama           AL

In [25]:
merged.dropna(inplace = True) #elimination of the NaN
print(merged.shape)
merged.head(3)

(2448, 5)

      ages  year  population    state abbreviation
0  under18  2012   1117489.0  Alabama           AL
1    total  2012   4817528.0  Alabama           AL
2  under18  2010   1130966.0  Alabama           AL

In [37]:
final = pd.merge(merged, areas, on ="state", how = "left")
final.head(3)

      ages  year  population    state abbreviation  area (sq. mi)
0  under18  2012   1117489.0  Alabama           AL        52423.0
1    total  2012   4817528.0  Alabama           AL        52423.0
2  under18  2010   1130966.0  Alabama           AL        52423.0

In [39]:
final.dropna(inplace = True)
final.head(3)

      ages  year  population    state abbreviation  area (sq. mi)
0  under18  2012   1117489.0  Alabama           AL        52423.0
1    total  2012   4817528.0  Alabama           AL        52423.0
2  under18  2010   1130966.0  Alabama           AL        52423.0

#### Feature Engineering - Coders survey 
Import the dataset in fcc_2016_coder_survey_subset.csv

In [45]:
coder_survey = pd.read_csv("C:\\Users\\34609\\Documents\\DataTB\\4.R\\Trans Py2R\\fcc_2016_coder_survey_subset.csv", encoding = "utf-8")
coder_survey[["ID.x","EmploymentField", "Age", "Income"]].head(3)

,ID.x,EmploymentField,Age,Income
0,cef35615d61b202f1dc794ef2746df14,office and administrative support,28.0,32000.0
1,323e5a113644d18185c743c241407754,food and beverage,22.0,15000.0
2,b29a1027e5cd062e654a63764157461d,finance,19.0,48000.0

In [46]:
coder_survey["EmploymentField"].unique()

array(['office and administrative support', 'food and beverage',
       'finance', 'arts, entertainment, sports, or media', 'education',
       'software development', nan, 'health care', 'sales',
       'law enforcement and fire and rescue', 'transportation',
       'architecture or physical engineering',
       'construction and extraction', 'software development and IT',
       'farming, fishing, and forestry', 'legal'], dtype=object)

## Fixed-width binning
### Developer age distribution - qiutar
Binning based on rounding

Crea una nueva columna en el dataframe, que muestre categorías (bins) como se muestra a continuación:
```
Age Range: Bin
---------------
 0 -  9  : 0
10 - 19  : 1
20 - 29  : 2
30 - 39  : 3
40 - 49  : 4
50 - 59  : 5
60 - 69  : 6
  ... and so on

In [54]:
coder_survey["Age_bin_round"] = np.array(np.floor(np.array(coder_survey["Age"]) / 10.)) #[Age] divided by 10 generation of an array, rounded to the lowest number and generate a new array
coder_survey[["ID.x", "Age", "Age_bin_round"]].tail(3)

                                   ID.x   Age  Age_bin_round
15617  5b1323796ca6ab9a58936ff772dbb988  37.0            3.0
15618  afe9f743395dedb14b09fe3e1c4db2a6  26.0            2.0
15619  bcfd613973e7746c38f49cd8dfd9ec6c  22.0            2.0

Definir la variable ID.x como variable de identificación.

In [ ]:
pd.melt(coder_survey, id_vars = ['ID.x'], value_vars = ['Age', 'Age_bin_round'])

                                   ID.x       variable  value
0      cef35615d61b202f1dc794ef2746df14            Age   28.0
1      323e5a113644d18185c743c241407754            Age   22.0
2      b29a1027e5cd062e654a63764157461d            Age   19.0
3      04a11e4bcb573a1261eb0d9948d32637            Age   26.0
4      9368291c93d5d5f5c8cdb1a575e18bec            Age   20.0
...                                 ...            ...    ...
31235  734bc2496485b7857ade38d4490cd1ec  Age_bin_round    3.0
31236  8d838e8e4604e995d83c95ab764fe78c  Age_bin_round    2.0
31237  5b1323796ca6ab9a58936ff772dbb988  Age_bin_round    3.0
31238  afe9f743395dedb14b09fe3e1c4db2a6  Age_bin_round    2.0
31239  bcfd613973e7746c38f49cd8dfd9ec6c  Age_bin_round    2.0

[31240 rows x 3 columns]

### Binning based on custom ranges

Crea una nueva columna en el dataframe que incluya categorías agrupadas (bins) tal y como se muestra a continuación:


``` 
Age Range : Bin
---------------
 0 -  15  : 1
16 -  30  : 2
31 -  45  : 3
46 -  60  : 4
61 -  75  : 5
76 - 100  : 6
```

In [56]:
bin_ranges = [0, 15, 30, 45, 60, 75, 100]
bin_names = [1, 2, 3, 4, 5, 6, 7]

coder_survey["Age_bin_custom_range"] = pd.cut(np.array(coder_survey["Age"]), bins = bin_ranges)
coder_survey[["ID.x", "Age", "Age_bin_round", "Age_bin_custom_range"]].tail(3) #view the binned features

,ID.x,Age,Age_bin_round,Age_bin_custom_range
15617,5b1323796ca6ab9a58936ff772dbb988,37.0,3.0,"(30, 45]"
15618,afe9f743395dedb14b09fe3e1c4db2a6,26.0,2.0,"(15, 30]"
15619,bcfd613973e7746c38f49cd8dfd9ec6c,22.0,2.0,"(15, 30]"

## Quantile based binning
Now we will work with the salaries of the dataset

### Calculate the 0, .25, .5, .75, 1. quantiles.

In [57]:
quantile_list = [0, 0.25, 0.5, 0.75, 1.0]
quantiles = coder_survey["Income"].quantile(quantile_list)
quantiles

0.00      6000.0
0.25     20000.0
0.50     37000.0
0.75     60000.0
1.00    200000.0
Name: Income, dtype: float64